{
	"attribution": "Adapted and modified from https://www.worldbadminton.com/glossary.htm",
	"categories": [
		{
			"category": "Serve Shots",
			"shots": [
				{ "id": 1,  "term": "Ace",          "definition": "A point scored by a serve that is not touched by the receiver." },
				{ "id": 18, "term": "Drive Serve",  "definition": "A serve hit flat and fast, skimming low over the net." },
				{ "id": 20, "term": "Drop Serve",   "definition": "A serve that barely clears the net and drops just beyond it." },
				{ "id": 22, "term": "Flick Serve",  "definition": "A serve used in doubles, using a quick flick of the wrist to send the shuttle high and deep." },
				{ "id": 30, "term": "Long Serve",   "definition": "A serve hit deep into the back boundary line of the receiver's court." },
				{ "id": 39, "term": "Serve",        "definition": "Stroke used to put the shuttlecock into play at the start of a rally." },
				{ "id": 40, "term": "Short Serve",  "definition": "A serve that barely clears the net and lands just inside the receiver's service court." },
				{ "id": 44, "term": "Spin Serve",   "definition": "A serve that imparts spin to the shuttle, making its flight unpredictable." },
				{ "id": 47, "term": "Toss Serve",   "definition": "A serve in which the shuttle is tossed up and then struck (now illegal in modern badminton)." }
			]
		},
		{
			"category": "Clear Shots",
			"shots": [
				{ "id": 3,  "term": "Attacking Clear",  "definition": "An offensive clear shot hit faster and flatter into the rear corners of the opponent’s court." },
				{ "id": 8,  "term": "Clear",            "definition": "A shot hit deep to the opponent's back boundary line. The high clear is a defensive shot, while the flatter attacking clear is used offensively." },
				{ "id": 15, "term": "Defensive Clear",  "definition": "A high, deep clear shot used to move the opponent back and gain time to recover position." },
				{ "id": 32, "term": "Offensive Clear",  "definition": "A clear hit with speed and flat trajectory to pressure the opponent." }
			]
		},
		{
			"category": "Drop Shots",
			"shots": [
				{ "id": 11, "term": "Cut (Slice)",    "definition": "A deceptive shot where the shuttle is sliced with the racket to reduce its speed and alter its direction." },
				{ "id": 12, "term": "Cut Drop",       "definition": "A drop shot where the shuttle is sliced to make it spin and tumble over the net." },
				{ "id": 19, "term": "Drop",           "definition": "A shot hit softly and with finesse to fall rapidly and close to the net on the opponent's side." }
			]
		},
		{
			"category": "Smash and Kill Shots",
			"shots": [
				{ "id": 4,  "term": "Kill",           "definition": "Fast, downward shot that cannot be returned; a 'putaway'." },
				{ "id": 27, "term": "Jump Smash",     "definition": "A smash performed while jumping, giving extra angle and power to the shot." },
				{ "id": 41, "term": "Smash",          "definition": "A hard-hit overhead shot that forces the shuttle sharply downward; badminton's primary attacking stroke." }
			]
		},
		{
			"category": "Net Shots",
			"shots": [
				{ "id": 24, "term": "Hairpin",      "definition": "A shot made from below and very close to the net, causing the shuttle to rise, just clear the net, and drop sharply down the other side; named because the shuttle's path resembles the shape of a hairpin." },
				{ "id": 31, "term": "Net Shot",     "definition": "Shot played from the forecourt close to the net that just clears the net and drops sharply." },
				{ "id": 13, "term": "Dab",          "definition": "A quick, controlled shot, usually played near the net to push the shuttle past an opponent." }
			]
		},
		{
			"category": "Drive Shots",
			"shots": [
				{ "id": 17, "term": "Drive",        "definition": "A fast and low shot that makes a horizontal flight over the net." }
			]
		},
		{
			"category": "Lift and Lob Shots",
			"shots": [
				{ "id": 28, "term": "Lift",         "definition": "A shot that sends the shuttle high and deep into the opponent's court." },
				{ "id": 29, "term": "Lob",          "definition": "A shot that is hit in a high arc, usually over the opponent's head to the back of the court (same as 'clear')." }
			]
		},
		{
			"category": "Push and Block Shots",
			"shots": [
				{ "id": 6,  "term": "Block",        "definition": "A shot used to return a smash, directed softly and close to the net." },
				{ "id": 37, "term": "Push Shot",    "definition": "A gentle shot played by pushing the shuttle with a little wrist motion, usually from net or midcourt to the opponent's midcourt." }
			]
		},
		{
			"category": "Specialty/Trick Shots & Misc",
			"shots": [
				{ "id": 2,  "term": "Air-Shot",         "definition": "A swing and a miss; an attempt to hit the shuttle but failing to do so." },
				{ "id": 5,  "term": "Backhand",         "definition": "Stroking the shuttle on the side of the body opposite the racket side." },
				{ "id": 7,  "term": "Carry",            "definition": "An illegal tactic, also called a sling or throw, where the shuttle is caught and held on the racket and then slung during the execution of a stroke." },
				{ "id": 9,  "term": "Closed Face",      "definition": "Describes the angle of the racket face when the top edge is tilted forward." },
				{ "id": 10, "term": "Cross Court",      "definition": "A shot hit diagonally from one side of the court to the other." },
				{ "id": 14, "term": "Danish Wipe",      "definition": "A trick shot performed by wiping the racket face around the shuttle at the net for deception." },
				{ "id": 16, "term": "Double Hit",       "definition": "An illegal shot where the shuttle is hit twice in succession by the same player or team." },
				{ "id": 21, "term": "Flick",            "definition": "A quick wrist-and-forearm rotation used to surprise an opponent by changing an apparently soft shot into a faster passing shot." },
				{ "id": 23, "term": "Forehand",         "definition": "Stroking the shuttle on the racket side of the body." },
				{ "id": 25, "term": "Halfcourt Shot",   "definition": "A shot that lands approximately midway between the net and the back boundary line." },
				{ "id": 26, "term": "Holding a Shot",   "definition": "Delaying the hit to deceive the opponent about the timing or direction of the shot." },
				{ "id": 33, "term": "Open Face",        "definition": "Describes the angle of the racket face when the top edge is tilted backward." },
				{ "id": 34, "term": "Pace",             "definition": "The speed or tempo of a shot." },
				{ "id": 35, "term": "Passing Shot",     "definition": "A shot directed past an opponent who is trying to defend near the net or midcourt." },
				{ "id": 36, "term": "Pop-Up",           "definition": "A weak return that rises high and sits up, making it easy for the opponent to smash." },
				{ "id": 38, "term": "Round-The-Head",   "definition": "A forehand overhead shot played on the backhand side of the body by rotating the body and arm." },
				{ "id": 42, "term": "Slice (Cut)",      "definition": "A shot that uses a slicing motion to create spin, causing the shuttle to travel in a curved trajectory." },
				{ "id": 43, "term": "Sling",            "definition": "An illegal tactic (same as carry or throw), in which the shuttle is caught and slung during the execution of a stroke." },
				{ "id": 45, "term": "Stroke",           "definition": "A movement of the player's racket with an intention to hit the shuttle." },
				{ "id": 46, "term": "Throw",            "definition": "An illegal tactic (same as carry or sling), where the shuttle is thrown rather than hit." },
				{ "id": 48, "term": "Wood Shot",        "definition": "A shot that results when the base of the shuttle is hit by the frame of the racket. Once illegal, this shot was legalized in 1963." }
			]
		}
	]
}